# Copyright (c) 2023 The Old Man and the C
#
# This file is part of Elden Ring Randomizer Hints.
#
# Elden Ring Randomizer Hints is free software: you can redistribute it and/or
# modify it under the terms of the GNU Affero General Public License as
# published by the Free Software Foundation, either version 3 of the License, or
# (at your option) any later version.
#
# Elden Ring Randomizer Hints is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
# or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Affero General Public License
# for more details.
#
# You should have received a copy of the GNU Affero General Public License along
# with Elden Ring Randomizer Hints. If not, see <https://www.gnu.org/licenses/>.

missableLots_jpnjp = {
    "104100": "聖樹の秘割符の右半分で彼女と出会った後、ラティナから与えられました。左半分を先に取得すると取り逃す可能性があります。",
    "104110": "彼女を 棄教の廃屋 に連れて行った後、ラティナ によって与えられました。 狼の眠るボロ家で彼女に会う前に彼女が死亡した場合、見逃される可能性があります。",
    "101500": "主なき猟犬の封牢でボスを倒した後、ブライヴから与えられます。 霧の森 で彼に会う前に ラダーン フェスティバルが始まると見逃す可能性があります。",
    "101590": "エインセル河本流で災いの影を倒した後、ラニから与えられる。場合によっては授与されないこともあります。",
    "1035460700": "エインセル河本流を倒した報酬。 ユラ を支援する前に死亡した場合は見逃される可能性があります。",
    "101610": "エインセル河本流戦で彼をアシストした後、ユラから与えられる。 ユラ を支援する前に死亡した場合は見逃される可能性があります。",
    "449020001": "壺村の大きなリビングポットの1つからドロップします。平和的な NPC を殺したくない場合は無視してください。",
    "449020002": "壺村の大きなリビングポットの1つからドロップします。平和的な NPC を殺したくない場合は無視してください。",
    "449020011": "壺村の大きなリビングポットの1つからドロップします。平和的な NPC を殺したくない場合は無視してください。",
    "449020012": "壺村の大きなリビングポットの1つからドロップします。平和的な NPC を殺したくない場合は無視してください。",
    "104000": "セレンを倒すのに協力した後、ジェーレンから与えられる。 セレン側の場合は見逃してしまう可能性があります。",
    "104010": "ジェーレンを倒した報酬。彼の側にいると見逃される可能性があります。",
    "101010": "ジェーレンに対して彼女を支援した後、セレンによって与えられました。 ジェーレン側の場合は見逃してしまう可能性があります。",
    "101030": "ルーサット を検索するために セレン によって与えられます。 サリアの封印鍵 が ルーサット によって保持されている場合、またはその他の方法で入手できない場合は、見逃される可能性があります。",
    "101061": "クエスト終了時に変身したセレンの近くに出現。 ジェーレン の側に立っている場合、または ルーサット を見つけて彼女の報酬を獲得できない場合は見逃される可能性があります。",
    "101070": "クエスト終了時に変身したセレンの近くに出現。 ジェーレン の側に立っている場合、または ルーサット を見つけて彼女の報酬を獲得できない場合は見逃される可能性があります。",
    "111001": "クエスト終了時に変身したセレンの近くに出現。 ジェーレン の側に立っている場合、または ルーサット を見つけて彼女の報酬を獲得できない場合は見逃される可能性があります。",
    "4900": "クエストの最後に 金仮面 からドロップします。 黄金樹 を書き込む前に 回帰性原理 を入手できない場合は、見逃される可能性があります。",
    "105000": "クエストの最後に 金仮面 からドロップします。 黄金樹 を書き込む前に 回帰性原理 を入手できない場合は、見逃される可能性があります。",
    "103582": "クエストの最後に ロジェール からドロップします。場合によってはこれが表示されないこともあります。",
    "103320": "ロジェール に 黒き刃の刻印 を与えるために フィア によって与えられます。入手するには ラニ への参加が必要な場合は見逃される可能性があります。",
    "103350": "死の床の夢でボスを倒した後、フィアからドロップします。 死の呪痕がそのボスまたは死に見えた者、Ｄに保持されている場合は見逃す可能性があります。",
    "103410": "クエストの最後に 死に見えた者、Ｄ からドロップします。 死の呪痕が死の床の夢または死に見えた者、Ｄのボスによって保持されている場合、見逃す可能性があります。",
    "1039480100": "改宗された辺境塔の上部のチェスト内。 叡智 ジェスチャが利用できない場合は、見逃される可能性があります。",
    "11001985": "狼の戦鬼、バルグラムとはぐれ魔術師、ヴィルヘルムを倒した報酬。 火山館の最終ボスを倒す前にベルナールへの手紙を入手できない場合は逃す可能性があります。",
    "111700": "アレキサンダーのクエストを完了する前にアレキサンダーを倒すとドロップします。彼のクエストを完了すると見逃される可能性があります。",
    "101740": "クエスト終了後に アレキサンダー からドロップします。それまでに彼を殺せば見逃す可能性があります。",
    "101700": "嵐の丘の穴から解放された後、アレキサンダーから与えられる。 フェスティバルが始まる前に連絡が取れない場合は見逃してしまう可能性があります。",
    "101710": "リエーニエの穴から解放された後、アレキサンダーから与えられる。 ゲルミア火山 に登場する前に 油壺 を作成できない場合は見逃してしまう可能性があります。",
    "112200": "ケネスを倒すとドロップします。彼のクエストを完了すると見逃される可能性があります。",
    "104512": "クエストの最後に ディアロス からドロップします。 火山館 の最後のボスを倒す前に 火山館 のリクエストを完了できない場合は見逃される可能性があります。",
    "101800": "最初の 火山館 リクエストの完了後に パッチ によって与えられます。 火山館の最終ボスを倒す前に依頼を完了できない場合は逃す可能性があります。",
    "101820": "侵略要求完了後にパッチから与えられる。 火山館の最終ボスを倒す前にパッチへの手紙を入手できない場合は見逃す可能性があります。",
    "104200": "ストームヴィル城でネフェリに話しかけた後、円卓でネフェリから与えられます。 ストームヴィル城に到達するために ストームヴィル城のボスを倒す必要がある場合は、見逃される可能性があります。",
    "104220": "クエストの最後に ネフェリ から与えられます。 黄金樹を書き込む前に嵐鷹の古王を入手できない場合は見逃してもいいでしょうか。",
    "114210": "彼女を殺すとネフェリからドロップします。彼女のクエストを完了すると見逃される可能性があります。",
    # "110810": "彼女を殺すとハイータからドロップします。彼女のクエストを完了すると見逃される可能性があります。",
    "100890": "クエストの最後に ハイータ からドロップします。それまでに彼女を殺せば見逃す可能性があります。",
    "100760": "最初の 火山館 リクエストの完了後に タニス によって与えられます。 火山館の最終ボスを倒す前に客間の鍵または火山館からの手紙 (イシュトバーン)を入手できない場合は逃す可能性があります。",
    "100770": "2 番目の 火山館 リクエストの完了後に タニス によって与えられます。最初のリクエストを完了できない場合、または 火山館 の最終ボスを倒す前に 火山館からの手紙 (ライリー) を入手できない場合は、失敗する可能性があります。",
    "100780": "3 番目の 火山館 リクエストの完了後に タニス によって与えられます。 2 番目のリクエストを完了できない場合、または 火山館 の最終ボスを倒す前に 赤い手紙 を入手できない場合は、失敗する可能性があります。",
    "100730": "火山館の客間のテーブル上。 火山館の最終ボスを倒す前に客間の鍵を入手できない場合は逃す可能性があります。",
    "100740": "火山館の客間のテーブル上。 火山館 の最後のボスを倒す前に最初の 火山館 リクエストを完了できない場合は、失敗する可能性があります。",
    "100750": "火山館の客間のテーブル上。 火山館 の最後のボスを倒す前に 2 番目の 火山館 リクエストを完了できない場合は、失敗する可能性があります。",
    "100900": "ラーヤの首飾りを彼女に返した後、ラーヤから与えられました。ネックレスを入手するために火山館に参加する必要がある場合は見逃される可能性があります。",
    "100910": "クエストの最後に ラーヤ からドロップします。 火山館の最終ボスを倒す前に蛇の羊膜を入手できない場合は逃す可能性があります。",
    "100500": "ゴストークがあなたを追いかけたときに彼と対峙した後に与えられます。 ストームヴィル城に到達するためにストームヴィル城のボスを倒す必要がある場合は、見逃される可能性があります。",
    "103910": "指殺しの刃を彼女に与えた後、ラニから与えられました。 指殺しの刃 が レナの魔術師塔 内にある場合、または 災いの影、ブライヴ、セルブス、または イジー によってドロップされた場合、見逃される可能性があります。",
    "1034510900": "レナの魔術師塔内のチェストに。 指殺しの刃 が レナの魔術師塔 内にある場合、または 災いの影、ブライヴ、セルブス、または イジー によってドロップされた場合、見逃される可能性があります。",
    "101430": "シーフラ河 で ブライヴ と会話した後、セルブス から与えられます。 ラニ に参加する前に ラダーン フェスティバルが始まると見逃してしまう可能性があります。",
    "101410": "琥珀の星光を贈った後、セルブスから贈られた。 ラニ に 指殺しの刃 を与える前に入手できない場合は見逃される可能性があります。",
    "101450": "琥珀の星光を贈った後、セルブスから贈られた。 ラニ に 指殺しの刃 を与える前に入手できない場合は見逃される可能性があります。",
    "103100": "無垢金の針 (壊れた)を贈った後、ゴーリーから贈られた。 ゴーリー、ミリセント、またはその姉妹が持っている場合は見逃す可能性があります。",
    "103110": "無垢金の針 (壊れた)を贈った後、ゴーリーから贈られた。 ゴーリー、ミリセント、またはその姉妹が持っている場合は見逃す可能性があります。",
    "103120": "ゴーリー のクエストの最後に彼を殺した後、ゴーリー からドロップします。彼のクエストを完了できない場合は見逃される可能性があります。",
    "103200": "無垢金の針 (修復) を贈った後、ミリセント から贈られました。 ゴーリー、ミリセント、またはその姉妹が持っている場合は見逃す可能性があります。",
    "103210": "彼女が姉妹を倒すのを手伝った後、ミリセントからドロップします。彼女の姉妹の側にいると見逃してしまう可能性があります。",
    "103220": "戦乙女の義手を与えた後に彼女を殺害した後、ミリセントからドロップします。彼女のクエストを完了すると見逃される可能性があります。",
    "113200": "姉妹たちを助けて ミリセント を倒した報酬。 ミリセント側の場合は見逃してしまう可能性があります。",
    "104800": "ミリセントの姉妹を倒した報酬。彼女の姉妹の側にいる場合は見逃してしまう可能性があります。",
    "104600": "クエストの最後に 小壺 から与えられます。 ディアロス クエストを完了できない場合は見逃される可能性があります。",
    "34140720": "ローデイルと禁域の間の橋にいる敵からドロップ。  敵がランダム化されている場合、このアイテムは元の敵によって新しいランダム化された場所 (存在する場合) にドロップされる場合とドロップされない場合があり、スポイラー ファイルの内容と一致しない可能性があります。 アイテムはまだ入手できるかもしれませんが、ヒントは正確ではない可能性があります。",
    "402030001": "貴き者たちの英雄墓の重いドアの近くおよび上の敵からドロップします。  敵がランダム化されている場合、このアイテムは元の敵によって新しいランダム化された場所 (存在する場合) にドロップされる場合とドロップされない場合があり、スポイラー ファイルの内容と一致しない可能性があります。 アイテムはまだ入手できるかもしれませんが、ヒントは正確ではない可能性があります。",
    "402040001": "サリアの隠し洞窟のクリスタルブリッジの下の最初の水たまりで敵からドロップします。  敵がランダム化されている場合、このアイテムは元の敵によって新しいランダム化された場所 (存在する場合) にドロップされる場合とドロップされない場合があり、スポイラー ファイルの内容と一致しない可能性があります。 アイテムはまだ入手できるかもしれませんが、ヒントは正確ではない可能性があります。",
    "1044350100": "アギール湖南東の敵からドロップ。  敵がランダム化されている場合、このアイテムは元の敵によって新しいランダム化された場所 (存在する場合) にドロップされる場合とドロップされない場合があり、スポイラー ファイルの内容と一致しない可能性があります。 アイテムはまだ入手できるかもしれませんが、ヒントは正確ではない可能性があります。",
    "1047370100": "ケイリッド街道南南の棺近くの敵からドロップ。  敵がランダム化されている場合、このアイテムは元の敵によって新しいランダム化された場所 (存在する場合) にドロップされる場合とドロップされない場合があり、スポイラー ファイルの内容と一致しない可能性があります。 アイテムはまだ入手できるかもしれませんが、ヒントは正確ではない可能性があります。",
    "1035430100": "湖の落下遺跡南の敵からドロップ。  敵がランダム化されている場合、このアイテムは元の敵によって新しいランダム化された場所 (存在する場合) にドロップされる場合とドロップされない場合があり、スポイラー ファイルの内容と一致しない可能性があります。 アイテムはまだ入手できるかもしれませんが、ヒントは正確ではない可能性があります。",
    "1043530100": "城壁沿いの小道北の遺跡で敵からドロップ。  敵がランダム化されている場合、このアイテムは元の敵によって新しいランダム化された場所 (存在する場合) にドロップされる場合とドロップされない場合があり、スポイラー ファイルの内容と一致しない可能性があります。 アイテムはまだ入手できるかもしれませんが、ヒントは正確ではない可能性があります。",
    "1036540100": "罪人送りの道東の敵からドロップ。  敵がランダム化されている場合、このアイテムは元の敵によって新しいランダム化された場所 (存在する場合) にドロップされる場合とドロップされない場合があり、スポイラー ファイルの内容と一致しない可能性があります。 アイテムはまだ入手できるかもしれませんが、ヒントは正確ではない可能性があります。",
    "1049550700": "聖別雪原、奥地南東の敵からドロップ。  敵がランダム化されている場合、このアイテムは元の敵によって新しいランダム化された場所 (存在する場合) にドロップされる場合とドロップされない場合があり、スポイラー ファイルの内容と一致しない可能性があります。 アイテムはまだ入手できるかもしれませんが、ヒントは正確ではない可能性があります。",
    "100420": "これは spoiler ファイルでは 放浪商人カーレ のものとして表示されますが、実際には彼のショップには表示されず、入手できません。",
    "39200000": "これは、spoiler ファイルでは、古遺跡断崖、対岸 の隣のエレベーターの基部近くの別のアイテムと同じ場所にあるように表示されますが、実際には世界に表示されず、入手できません。",
}

missableShopLots_jpnjp = {
    "100056": "ジェーレンに対して彼女を支援した後、セレンショップで入手可能。 ジェーレン側の場合は見逃してしまう可能性があります。",
    "100361": "ラダゴン スタチューのマスクを解除した後、コリン ショップで入手できます。 黄金樹 を書き込む前に 回帰性原理 を入手できない場合は、見逃される可能性があります。",
    "100018": "ネフェリのクエストを完了すると、ゴストークショップで入手可能になります。 ネフェリのクエストを完了できない場合は見逃される可能性があります。",
    "100301": "セルブスの精薬をネフェリに与えた後、セルブスパペットショップで入手可能。彼女にポーションを与えないと見逃してしまう可能性があります。",
    "100310": "セルブスの精薬を糞喰いに与えた後、セルブスパペットショップで入手可能。ポーションを与えないと見逃してしまう可能性があります。",
    "100177": "ミリセントに無垢金の針 (修復)を与えた後、ゴーリーショップで入手可能です。 ゴーリー、ミリセント、またはその姉妹が持っている場合は見逃す可能性があります。",
    "100175": "ミリセントに無垢金の針 (修復)を与えた後、ゴーリーショップで入手可能です。 ゴーリー、ミリセント、またはその姉妹が持っている場合は見逃す可能性があります。",
    "100176": "ミリセントに無垢金の針 (修復)を与えた後、ゴーリーショップで入手可能です。 ゴーリー、ミリセント、またはその姉妹が持っている場合は見逃す可能性があります。",
    "100185": "ミリセントに戦乙女の義手を与えた後、ゴーリーショップで入手可能です。 ゴーリー、ミリセント、またはその姉妹が持っている場合は見逃す可能性があります。",
}

