# Copyright (c) 2023 The Old Man and the C
#
# This file is part of Elden Ring Randomizer Hints.
#
# Elden Ring Randomizer Hints is free software: you can redistribute it and/or
# modify it under the terms of the GNU Affero General Public License as
# published by the Free Software Foundation, either version 3 of the License, or
# (at your option) any later version.
#
# Elden Ring Randomizer Hints is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
# or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Affero General Public License
# for more details.
#
# You should have received a copy of the GNU Affero General Public License along
# with Elden Ring Randomizer Hints. If not, see <https://www.gnu.org/licenses/>.

missableLots_korkr = {
    "104100": "성수의 비부절의 오른쪽 절반으로 그녀를 만난 후 라티나가 제공합니다. 왼쪽 절반을 먼저 얻으면 놓칠 수 있습니다.",
    "104110": "그녀를 기교의 폐옥로 데려온 후 라티나가 제공합니다. 늑대가 잠든 오두막에서 그녀를 만나기 전에 그녀가 죽으면 놓칠 수 있습니다.",
    "101500": "주인 잃은 사냥개의 봉인감옥에서 보스를 물리친 후 블라이드가 제공합니다. 안개 숲에서 그를 만나기 전에 라단 페스티벌이 시작된다면 놓칠 수 있습니다.",
    "101590": "에인세르 강 본류에서 재앙의 그림자를 격파한 후 라니가 제공합니다. 때로는 이것이 수여되지 않을 수도 있습니다.",
    "1035460700": "에인세르 강 본류를 격파한 보상입니다. 당신이 그를 돕기 전에 유라가 죽으면 놓칠 수 있습니다.",
    "101610": "에인세르 강 본류를 상대로 유라를 도운 후 유라가 제공합니다. 당신이 그를 돕기 전에 유라가 죽으면 놓칠 수 있습니다.",
    "449020001": "항아리 마을의 대형 거실 화분 중 하나에서 드롭하세요. 평화로운 NPC를 죽이고 싶지 않다면 놓칠 수 있습니다.",
    "449020011": "항아리 마을의 대형 거실 화분 중 하나에서 드롭하세요. 평화로운 NPC를 죽이고 싶지 않다면 놓칠 수 있습니다.",
    "104000": "셀렌를 물리치는 데 도움을 준 후 제렌가 제공합니다. 셀렌를 사용한다면 놓칠 수 있습니다.",
    "104010": "제렌를 격파한 보상입니다. 그 사람 편에 서면 놓칠 수 있어요.",
    "101010": "제렌에 맞서 그녀를 도운 후 셀렌가 제공합니다. 제렌를 사용한다면 놓칠 수 있습니다.",
    "100056": "제렌에 맞서 그녀를 도운 후 셀렌 상점에서 사용할 수 있습니다. 제렌를 사용한다면 놓칠 수 있습니다.",
    "101030": "루사트를 찾기 위해 셀렌에서 제공합니다. 사리아의 봉인 열쇠가 루사트에 의해 보유되거나 다른 방법으로 획득할 수 없는 경우 놓칠 수 있습니다.",
    "101070": "퀘스트가 끝나면 변신한 후 셀렌 근처에 나타납니다. 제렌의 편에 서거나 루사트를 찾아 보상을 받을 수 없는 경우에는 놓칠 수 있습니다.",
    "100361": "라다곤 동상의 마스크를 해제한 후 콜린 상점에서 이용 가능합니다. 황금 나무의를 굽기 전에 회귀성원리를 얻을 수 없으면 놓칠 수 있습니다.",
    "4900": "퀘스트가 끝나면 금가면에서 떨어집니다. 황금 나무의를 굽기 전에 회귀성원리를 얻을 수 없으면 놓칠 수 있습니다.",
    "105000": "퀘스트가 끝나면 금가면에서 떨어집니다. 황금 나무의를 굽기 전에 회귀성원리를 얻을 수 없으면 놓칠 수 있습니다.",
    "103582": "퀘스트가 끝나면 로지에르에서 떨어집니다. 때로는 이것이 나타나지 않을 수도 있습니다.",
    "103320": "로지에르에 검은 칼날의 각인를 제공한 대가로 피아에서 제공합니다. 라니를 얻기 위해 가입이 필요한 경우 놓칠 수 있습니다.",
    "103350": "Deathbed Dream에서 보스를 물리친 후 피아에서 드롭됩니다. 해당 상사가 죽음의 주흔를 들고 있거나 죽음을 본 자 D를 갖고 있다면 놓칠 수 있습니다.",
    "103410": "퀘스트가 끝나면 죽음을 본 자 D에서 드롭됩니다. 죽음의 주흔를 데스베드드림의 보스나 죽음을 본 자 D가 들고 있다면 놓칠 수 있습니다.",
    "1039480100": "개종된 변방의 탑 상단의 가슴에. 학원의 휘석 열쇠 (토푸스)가 같은 상자에 있거나 다른 방법으로 얻을 수 없는 경우 놓칠 수 있습니다.",
    "11001985": "늑대 전투광 바르글룸 및 외톨이 마술사 빌헬름를 격파한 보상입니다. 화산관의 최종 보스를 물리치기 전에 베르나르에게 보내는 편지를 획득할 수 없다면 놓칠 수 있습니다.",
    "111700": "퀘스트를 완료하기 전에 그를 죽이면 알렉산더에서 드롭됩니다. 그의 퀘스트를 완료하면 놓칠 수 있습니다.",
    "101740": "퀘스트를 마친 후 알렉산더에서 드롭하세요. 그 전에 죽이면 놓칠 수 있습니다.",
    "101710": "리에니에의 구멍에서 알렉산더를 구출한 후 알렉산더가 제공합니다. 겔미어 화산에 나타나기 전에 기름 항아리를 만들 수 없다면 놓칠 수 있습니다.",
    "112200": "그를 죽이면 케네스에서 드롭됩니다. 그의 퀘스트를 완료하면 놓칠 수 있습니다.",
    "104512": "퀘스트가 끝나면 디아로스에서 떨어집니다. 화산관의 최종 보스를 물리치기 전에 화산관 요청을 완료하지 못하면 놓칠 수 있습니다.",
    "101800": "첫 번째 화산관 요청을 완료한 후 패치에 의해 제공됩니다. 화산관의 최종 보스를 처치하기 전에 의뢰를 완료하지 못하면 놓칠 수 있습니다.",
    "101820": "침입 요청을 완료한 후 패치가 제공합니다. 화산관의 최종 보스를 물리치기 전에 패치에게 보내는 편지를 얻을 수 없다면 놓칠 수 있습니다.",
    "104200": "스톰빌 성에서 네펠리과 대화한 후 원탁에서 네펠리이 제공합니다. 스톰빌 성에 도달하기 위해 스톰빌 성의 보스를 물리쳐야 하는 경우에는 놓칠 수 있습니다.",
    "104220": "퀘스트가 끝나면 네펠리가 제공합니다. 황금 나무의를 굽기 전에 폭풍 매의 옛 왕를 얻을 수 없으면 놓칠 수 있나요?",
    "114210": "그녀를 죽이면 네펠리에서 드롭됩니다. 그녀의 퀘스트를 완료하면 놓칠 수 있습니다.",
    "110810": "그녀를 죽이면 하이타에서 드롭됩니다. 그녀의 퀘스트를 완료하면 놓칠 수 있습니다.",
    "100890": "퀘스트가 끝나면 하이타에서 드롭됩니다. 그 전에 죽이면 놓칠 수 있습니다.",
    "100760": "첫 번째 화산관 요청을 완료한 후 타니스에 의해 제공됩니다. 화산관의 최종 보스를 물리치기 전에 객실 열쇠 또는 화산관에서 보낸 편지 (이슈트반)를 획득할 수 없는 경우에는 놓칠 수 있습니다.",
    "100770": "두 번째 화산관 요청을 완료한 후 타니스에 의해 제공됩니다. 화산관의 최종 보스를 처치하기 전에 첫 번째 요청을 완료하지 못하거나 화산관에서 보낸 편지 (라일리)를 획득하지 못한 경우에는 놓칠 수 있습니다.",
    "100780": "세 번째 화산관 요청을 완료한 후 타니스에 의해 제공됩니다. 화산관의 최종 보스를 처치하기 전에 두 번째 의뢰를 완료하지 못하거나 붉은 편지를 획득하지 못한 경우에는 놓칠 수 있습니다.",
    "100730": "화산관 객실의 테이블에 있습니다. 화산관의 최종 보스를 물리치기 전에 객실 열쇠를 획득하지 못한 경우에는 놓칠 수 있습니다.",
    "100740": "화산관 객실의 테이블에 있습니다. 화산관의 최종 보스를 물리치기 전에 첫 번째 화산관 요청을 완료할 수 없는 경우 놓칠 수 있습니다.",
    "100750": "화산관 객실의 테이블에 있습니다. 화산관의 최종 보스를 물리치기 전에 두 번째 화산관 요청을 완료할 수 없는 경우 놓칠 수 있습니다.",
    "100900": "라야의 목걸이를 그녀에게 돌려준 후 라야가 제공합니다. 목걸이를 획득하기 위해 화산관에 가입해야 한다면 놓칠 수 있습니다.",
    "100910": "퀘스트가 끝나면 라야에서 드롭됩니다. 화산관의 최종 보스를 물리치기 전에 뱀의 양막를 획득하지 못한 경우에는 놓칠 수 있습니다.",
    "100500": "고스토크 당신을 따라다닐 때 마주한 후 줍니다. 스톰빌 성에 도달하기 위해 스톰빌 성의 보스를 물리쳐야 하는 경우에는 놓칠 수 있습니다.",
    "100018": "네펠리 퀘스트를 완료한 후 고스토크 상점에서 구매할 수 있습니다. 네펠리의 퀘스트를 완료할 수 없는 경우 놓칠 수 있습니다.",
    "103910": "손가락 죽임의 칼날를 준 후 라니가 제공합니다. 손가락 죽임의 칼날가 레나의 마술사탑 내부에 있거나 재앙의 그림자, 블라이드, 셀브스 또는 이지에 의해 삭제된 경우 누락될 수 있습니다.",
    "1034510900": "레나의 마술사탑 내부의 가슴에. 손가락 죽임의 칼날가 레나의 마술사탑 내부에 있거나 재앙의 그림자, 블라이드, 셀브스 또는 이지에 의해 삭제된 경우 누락될 수 있습니다.",
    "101430": "시프라 강의 블라이드와 대화한 후 셀브스가 제공합니다. 라니에 가입하기 전에 라단 페스티벌이 시작되면 놓칠 수 있습니다.",
    "101410": "호박색 별빛를 준 후 셀브스가 제공합니다. 라니에 손가락 죽임의 칼날를 주기 전에 획득할 수 없는 경우 놓칠 수 있습니다.",
    "101450": "호박색 별빛를 준 후 셀브스가 제공합니다. 라니에 손가락 죽임의 칼날를 주기 전에 획득할 수 없는 경우 놓칠 수 있습니다.",
    "100301": "셀브스의 정약를 네펠리에게 준 후 셀브스 인형 상점에서 사용할 수 있습니다. 그녀에게 물약을 주지 않으면 놓칠 수 있습니다.",
    "100310": "셀브스의 정약를 대변 먹는 자에 준 후 셀브스 인형 상점에서 사용할 수 있습니다. 그에게 물약을 주지 않으면 놓칠 수 있습니다.",
    "100177": "밀리센트에 무구한 금의 침 (복구)를 제공한 후 고리 상점에서 구매할 수 있습니다. 고리, 밀리센트 또는 그 자매가 보유하고 있으면 놓칠 수 있습니다.",
    "100175": "밀리센트에 무구한 금의 침 (복구)를 제공한 후 고리 상점에서 구매할 수 있습니다. 고리, 밀리센트 또는 그 자매가 보유하고 있으면 놓칠 수 있습니다.",
    "100176": "밀리센트에 무구한 금의 침 (복구)를 제공한 후 고리 상점에서 구매할 수 있습니다. 고리, 밀리센트 또는 그 자매가 보유하고 있으면 놓칠 수 있습니다.",
    "100185": "밀리센트에 전쟁 처녀의 의수를 제공한 후 고리 상점에서 구매할 수 있습니다. 고리, 밀리센트 또는 그 자매가 보유하고 있으면 놓칠 수 있습니다.",
    "103100": "무구한 금의 침 (깨진)를 준 후 고리가 제공합니다. 고리, 밀리센트 또는 그 자매가 보유하고 있으면 놓칠 수 있습니다.",
    "103110": "무구한 금의 침 (깨진)를 준 후 고리가 제공합니다. 고리, 밀리센트 또는 그 자매가 보유하고 있으면 놓칠 수 있습니다.",
    "103120": "퀘스트가 끝나면 그를 죽인 후 고리에서 떨어집니다. 퀘스트를 완료할 수 없으면 놓칠 수 있습니다.",
    "103200": "그녀에게 무구한 금의 침 (복구)를 준 후 밀리센트가 제공합니다. 고리, 밀리센트 또는 그 자매가 보유하고 있으면 놓칠 수 있습니다.",
    "103210": "그녀가 자매를 물리치는 것을 도운 후 밀리센트에서 드롭됩니다. 그녀의 자매들과 함께라면 놓칠 수 있습니다.",
    "103220": "그녀에게 전쟁 처녀의 의수를 준 후 그녀를 죽인 후 밀리센트에서 드롭합니다. 그녀의 퀘스트를 완료하면 놓칠 수 있습니다.",
    "113200": "자매들을 도와 밀리센트를 물리친 것에 대한 보상입니다. 밀리센트를 사용한다면 놓칠 수 있습니다.",
    "104800": "밀리센트의 자매를 물리친 보상입니다. 그녀의 자매들과 함께라면 놓칠 수 있습니다.",
    "104600": "퀘스트가 끝나면 작은 항아리가 제공합니다. 디아로스 퀘스트를 완료할 수 없는 경우 놓칠 수 있습니다.",
    "100420": "이는 spoiler 파일에는 방랑 상인 칼레의 소유로 등장하지만, 그의 상점에는 실제로 등장하지 않아 구할 수 없다.",
    "1037500000": "이는 spoiler 파일에서는 계곡에 숨은 마을 근처에 있는 것으로 등장하지만 실제로는 월드에 등장하지 않아 구할 수 없다.",
    "39200000": "이는 spoiler 파일에서는 옛 유적 절벽 맞은편 옆 엘리베이터 바닥 부근의 다른 아이템과 같은 위치에 있는 것으로 나타나 있으나 실제로는 월드에 등장하지 않아 획득할 수 없다.",
}
