# Copyright (c) 2023 The Old Man and the C
#
# This file is part of Elden Ring Randomizer Hints.
#
# Elden Ring Randomizer Hints is free software: you can redistribute it and/or
# modify it under the terms of the GNU Affero General Public License as
# published by the Free Software Foundation, either version 3 of the License, or
# (at your option) any later version.
#
# Elden Ring Randomizer Hints is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
# or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Affero General Public License
# for more details.
#
# You should have received a copy of the GNU Affero General Public License along
# with Elden Ring Randomizer Hints. If not, see <https://www.gnu.org/licenses/>.

missableLots_rusru = {
    "104100": "Дается Латенна после встречи с правой половиной Тайный медальон Святого Древа. Можно пропустить, если сначала вы получите левую половину.",
    "104110": "Дано Латенна после того, как она привела ее в Руины вероотступников. Ее можно пропустить, если она умрет до того, как вы встретите ее в Лачуга волчьего ночлега.",
    "101500": "Дается Блайд после победы над боссом в Узилище одинокой ищейки. Можно пропустить, если фестиваль Радан начнется до того, как вы встретите его в Туманный лес.",
    "101590": "Выдается Ренни после победы над Тень Погибели в Основной поток реки Ансель. Иногда эта награда не присуждается.",
    "1035460700": "Награда за победу над Основной поток реки Ансель. Можно пропустить, если Юра умрет до того, как вы сможете ему помочь.",
    "101610": "Дано Юра после помощи ему против Основной поток реки Ансель. Можно пропустить, если Юра умрет до того, как вы сможете ему помочь.",
    "449020001": "Выпадает из одного из больших живых горшков в Кувшинград. Можно пропустить, если не хотите убивать мирного NPC.",
    "449020011": "Выпадает из одного из больших живых горшков в Кувшинград. Можно пропустить, если не хотите убивать мирного NPC.",
    "104000": "Дается Джеррен после того, как помог ему победить Селлена. Можно пропустить, если вы на стороне Селлена.",
    "104010": "Награда за победу над Джеррен. Можно пропустить, если вы встанете на его сторону.",
    "101010": "Дано Селлена после помощи ей против Джеррен. Можно пропустить, если вы на стороне Джеррен.",
    "100056": "Доступен в магазине Селлена после помощи ей в борьбе с Джеррен. Можно пропустить, если вы на стороне Джеррен.",
    "101030": "Выдается Селлена для поиска Лусат. Может быть пропущен, если Селлийский крушитель печатей принадлежит Лусат или недоступен по другим причинам.",
    "101070": "Появляется рядом с Селлена после трансформации в конце квеста. Можно пропустить, если вы на стороне Джеррен или не можете получить ее награду за нахождение Лусат.",
    "100361": "Доступен в магазине Корин после снятия маски со статуи Радагон. Может быть пропущен, если Принцип регрессии недоступен до записи Древа Эрд.",
    "4900": "Выпадает из Золотая Маска в конце его квеста. Может быть пропущен, если Принцип регрессии недоступен до записи Древа Эрд.",
    "105000": "Выпадает из Золотая Маска в конце его квеста. Может быть пропущен, если Принцип регрессии недоступен до записи Древа Эрд.",
    "103582": "Выпадает из Рожер в конце его квеста. Иногда это не отображается.",
    "103320": "Выдано Фия за предоставление Рожер Отметка от Чёрного Ножа. Можно пропустить, если для его получения требуется присоединение к Ренни.",
    "103350": "Выпадает из Фия после победы над боссом в Сне на смертном одре. Может быть пропущен, если Знак проклятия находится в руках этого босса или Ди, Свидетель Смерти.",
    "103410": "Выпадает из Ди, Свидетель Смерти в конце его квеста. Можно пропустить, если Знак проклятия находится в руках босса Смертельного сна или Ди, Свидетель Смерти.",
    "1039480100": "В сундуке наверху Окраины изменённой башни. Можно пропустить, если Волшебный ключ академии (Топс) находится в том же сундуке или недоступен по другим причинам.",
    "11001985": "Награда за победу над Варграм Свирепый Волк и Бродячий чародей Вильгельм. Можно пропустить, если Письмо Берналу невозможно получить до победы над финальным боссом Вулканово поместье.",
    "111700": "Выпадает из Александр, если вы убьете его до завершения квеста. Можно пропустить, если выполнить его квест.",
    "101740": "Выпадает из Александр после завершения квеста. Можно пропустить, если убить его до этого.",
    "101710": "Дается Александр после освобождения его из дыры в Лиурния. Можно пропустить, если вы не сможете сделать Горшок масла до того, как он появится в Вулкан Гельмир.",
    "112200": "Выпадет из Кеннет, если вы его убьете. Можно пропустить, если выполнить его квест.",
    "104512": "Выпадает из Диаллос в конце его квеста. Можно пропустить, если вы не можете выполнить запросы Вулканово поместье до победы над финальным боссом Вулканово поместье.",
    "101800": "Выдается Лоскутик после выполнения первого запроса Вулканово поместье. Можно пропустить, если вы не сможете выполнить запрос до победы над финальным боссом Вулканово поместье.",
    "101820": "Дано Лоскутик после выполнения запроса на вторжение. Можно пропустить, если Письмо Лоскутику невозможно получить до победы над финальным боссом Вулканово поместье.",
    "104200": "Дано Нефели в Крепость Круглого стола после разговора с ней в Замок Грозовой Завесы. Можно пропустить, если для достижения Замок Грозовой Завесы необходимо победить босса Замок Грозовой Завесы.",
    "104220": "Дается Нефели в конце ее квеста. Могу ли я пропустить, если Король штормовых ястребов нельзя получить перед записью Древа Эрд.",
    "114210": "Выпадет из Нефели, если вы ее убьете. Можно пропустить, если выполнить ее квест.",
    "110810": "Выпадет из Хёйтта, если вы ее убьете. Можно пропустить, если выполнить ее квест.",
    "100890": "Выпадает из Хёйтта в конце ее квеста. Можно пропустить, если убить ее до этого.",
    "100760": "Выдается Танит после выполнения первого запроса Вулканово поместье. Можно пропустить, если Ключ от гостиной или Письмо из Вулканова поместья (Истван) невозможно получить до победы над финальным боссом Вулканово поместье.",
    "100770": "Выдается Танит после выполнения второго запроса Вулканово поместье. Можно пропустить, если первый запрос не может быть выполнен или Письмо из Вулканова поместья (Рилей) не может быть получен до победы над финальным боссом Вулканово поместье.",
    "100780": "Выдается Танит после выполнения третьего запроса Вулканово поместье. Можно пропустить, если второй запрос не может быть выполнен или Красное письмо не может быть получен до победы над финальным боссом Вулканово поместье.",
    "100730": "На столе в Вулканово поместье гостиной. Можно пропустить, если Ключ от гостиной невозможно получить до победы над финальным боссом Вулканово поместье.",
    "100740": "На столе в Вулканово поместье гостиной. Можно пропустить, если первый запрос Вулканово поместье не может быть выполнен до победы над финальным боссом Вулканово поместье.",
    "100750": "На столе в Вулканово поместье гостиной. Можно пропустить, если второй запрос Вулканово поместье не может быть выполнен до победы над финальным боссом Вулканово поместье.",
    "100900": "Дано Райя после возвращения ей Ожерелье Райи. Можно пропустить, если вам нужно присоединиться к Вулканово поместье, чтобы получить ожерелье.",
    "100910": "Выпадает из Райя в конце ее квеста. Можно пропустить, если вы не можете получить Змеиный амнион до победы над финальным боссом Вулканово поместье.",
    "100500": "Дается Госток после столкновения с ним, когда он следует за вами. Можно пропустить, если для достижения Замок Грозовой Завесы необходимо победить босса Замок Грозовой Завесы.",
    "100018": "Доступен в магазине Госток после выполнения квеста Нефели. Можно пропустить, если вы не можете выполнить квест Нефели.",
    "103910": "Дано Ренни после того, как она подарила ей Клинок убийцы Пальцев. Может быть пропущен, если Клинок убийцы Пальцев находится внутри Башня Ренны или удаляется Тень Погибели, Блайд, Селувис или Иджи.",
    "1034510900": "В сундуке внутри Башня Ренны. Может быть пропущен, если Клинок убийцы Пальцев находится внутри Башня Ренны или удаляется Тень Погибели, Блайд, Селувис или Иджи.",
    "101430": "Дано Селувис после разговора с Блайд в Река Сиофра. Можно пропустить, если фестиваль Радан начнется до того, как вы присоединитесь к Ренни.",
    "101410": "Дано Селувис после того, как он подарил ему Звездосветный янтарь. Может быть пропущен, если его невозможно получить до передачи Ренни Клинок убийцы Пальцев.",
    "101450": "Дано Селувис после того, как он подарил ему Звездосветный янтарь. Может быть пропущен, если его невозможно получить до передачи Ренни Клинок убийцы Пальцев.",
    "100301": "Доступен в магазине кукол Селувис после передачи Зелье Селувиса Нефели. Можно пропустить, если не дать ей зелье.",
    "100310": "Доступен в магазине кукол Селувис после передачи Зелье Селувиса Поедатель Отбросов. Можно пропустить, если не дать ему зелье.",
    "100177": "Доступен в магазине Гоури после передачи Миллисента Игла из чистого золота (Отремонтированы). Можно пропустить, если он принадлежит Гоури, Миллисента или ее сестрам.",
    "100175": "Доступен в магазине Гоури после передачи Миллисента Игла из чистого золота (Отремонтированы). Можно пропустить, если он принадлежит Гоури, Миллисента или ее сестрам.",
    "100176": "Доступен в магазине Гоури после передачи Миллисента Игла из чистого золота (Отремонтированы). Можно пропустить, если он принадлежит Гоури, Миллисента или ее сестрам.",
    "100185": "Доступен в магазине Гоури после передачи Миллисента Протез валькирии. Можно пропустить, если он принадлежит Гоури, Миллисента или ее сестрам.",
    "103100": "Дано Гоури после того, как он подарил ему Игла из чистого золота (Разбитый). Можно пропустить, если он принадлежит Гоури, Миллисента или ее сестрам.",
    "103110": "Дано Гоури после того, как он подарил ему Игла из чистого золота (Разбитый). Можно пропустить, если он принадлежит Гоури, Миллисента или ее сестрам.",
    "103120": "Выпадает из Гоури после его убийства в конце квеста. Можно пропустить, если его квест невозможно выполнить.",
    "103200": "Дано Миллисента после того, как она подарила ей Игла из чистого золота (Отремонтированы). Можно пропустить, если он принадлежит Гоури, Миллисента или ее сестрам.",
    "103210": "Выпадает из Миллисента после того, как помог ей победить сестер. Можно пропустить, если вы встанете на сторону ее сестер.",
    "103220": "Выпадает из Миллисента после того, как убьет ее и отдаст ей Протез валькирии. Можно пропустить, если выполнить ее квест.",
    "113200": "Награда за победу над Миллисента, помогая ее сестрам. Можно пропустить, если вы на стороне Миллисента.",
    "104800": "Награда за победу над сестрами Миллисента. Можно пропустить, если вы встанете на сторону ее сестер.",
    "104600": "Дается Дитя кувшина в конце его квеста. Можно пропустить, если квест Диаллос не может быть выполнен.",
    "100420": "В файле spoiler он указан как принадлежащий Торговец Кале, но на самом деле он не появляется в его магазине и не может быть получен.",
    "34140720": "Падение с врага на мосту между Лейнделл и Запретные земли. Иногда это не присуждается.",
    "402030001": "Падайте с врага рядом и над тяжелой дверью в Могила героя-святого. Иногда это не присуждается.",
    "1037500000": "В файле spoiler он отображается как находящийся рядом с Укрытая ущельем деревня, но на самом деле он не появляется в мире и не может быть получен.",
    "39200000": "В файле spoiler он отображается как находящийся в том же месте, что и другой предмет возле основания лифта рядом с Возвышение у обрыва с руинами, но на самом деле он не появляется в мире и не может быть получен.",
}
