# Copyright (c) 2023 The Old Man and the C
#
# This file is part of Elden Ring Randomizer Hints.
#
# Elden Ring Randomizer Hints is free software: you can redistribute it and/or
# modify it under the terms of the GNU Affero General Public License as
# published by the Free Software Foundation, either version 3 of the License, or
# (at your option) any later version.
#
# Elden Ring Randomizer Hints is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
# or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Affero General Public License
# for more details.
#
# You should have received a copy of the GNU Affero General Public License along
# with Elden Ring Randomizer Hints. If not, see <https://www.gnu.org/licenses/>.

missableLots_zhocn = {
    "104100": "勒缇娜 在与 圣树秘密符节 的右半部分会面后给予她。如果您先获得左半部分，则可能会错过。",
    "104110": "由勒缇娜将她带到离教废屋后给予。如果你在 眠狼的破屋 中见到她之前她就去世了，你可能会错过她。",
    "101500": "无主猎犬的封印监牢击败Boss后布莱泽赠送。如果 拉塔恩 音乐节在您在 雾林 见到他之前开始，您可能会错过。",
    "101590": "在安瑟尔河主流中击败灾厄影子后由菈妮给予。有时这不会被授予。",
    "1035460700": "击败安瑟尔河主流的奖励。如果 尤拉 在您帮助他之前死亡，则可能会错过。",
    "101610": "尤拉在协助他对抗安瑟尔河主流后给予。如果 尤拉 在您帮助他之前死亡，则可能会错过。",
    "449020001": "从 壶村 的大型生活罐之一掉落。如果你不想杀死和平的NPC，可以错过。",
    "449020011": "从 壶村 的大型生活罐之一掉落。如果你不想杀死和平的NPC，可以错过。",
    "104000": "杰廉帮助他击败瑟濂后赠送。如果您支持 瑟濂，可能会错过。",
    "104010": "击败杰廉的奖励。如果你站在他一边，你可能会错过。",
    "101010": "瑟濂在协助她对抗杰廉后给予。如果您支持 杰廉，可能会错过。",
    "100056": "协助她对抗 杰廉 后，可在 瑟濂 商店中找到。如果您支持 杰廉，可能会错过。",
    "101030": "由 瑟濂 给出，用于查找 卢瑟特。如果 瑟利亚封印钥匙 由 卢瑟特 持有或以其他方式无法获得，则可能会错过。",
    "101070": "瑟濂 在任务结束时变形后出现在她附近。如果您支持 杰廉 或无法获得她寻找 卢瑟特 的奖励，则可能会错过。",
    "100361": "揭开 拉达冈 雕像后，可在 柯林 商店购买。如果在刻录 黄金树 之前无法获取 回归性原理，则可能会错过。",
    "4900": "在任务结束时从 金面具 掉落。如果在刻录 黄金树 之前无法获取 回归性原理，则可能会错过。",
    "105000": "在任务结束时从 金面具 掉落。如果在刻录 黄金树 之前无法获取 回归性原理，则可能会错过。",
    "103582": "在任务结束时从 罗杰尔 掉落。有时这个不会出现。",
    "103320": "由 菲雅 给予 罗杰尔 黑刀烙印。如果需要加入菈妮才能获得，可以错过。",
    "103350": "击败临终之梦中的 Boss 后，从 菲雅 掉落。如果 死亡的咒痕 被该 Boss 或 “觐见死亡”Ｄ 持有，则可能会错过。",
    "103410": "在任务结束时从 “觐见死亡”Ｄ 掉落。如果 死亡的咒痕 被临终之梦或 “觐见死亡”Ｄ 的 Boss 持有，则可能会错过。",
    "1039480100": "改宗边境塔顶部的箱子里。如果 学院辉石钥匙 (托普斯) 位于同一个箱子中或无法获得，则可能会错过。",
    "11001985": "击败“白狼战鬼”巴格莱姆和“离群魔法师”维赫勒的奖励。如果在击败 火山官邸 的最终 Boss 之前无法获得 给贝纳尔的信，则可能会错过。",
    "111700": "如果你在完成他的任务之前杀死他，就会从 亚历山大 中掉落。如果你完成了他的任务，可能会错过。",
    "101740": "完成任务后从 亚历山大 掉落。如果你在那之前杀了他，可能会错过。",
    "101710": "亚历山大将他从利耶尼亚的洞中释放后给予。如果您在 油壶 出现在 格密尔火山 之前无法制作 油壶，则可能会错过。",
    "112200": "如果你杀了他，就会从 肯尼斯 中掉落。如果你完成了他的任务，可能会错过。",
    "104512": "在任务结束时从 狄亚罗斯 掉落。如果您在击败 火山官邸 的最终 Boss 之前无法完成 火山官邸 的请求，则可能会错过。",
    "101800": "完成第一个 火山官邸 请求后由 帕奇 给出。如果您在击败 火山官邸 的最终 Boss 之前无法完成请求，则可能会错过。",
    "101820": "帕奇完成入侵请求后给予。如果在击败 火山官邸 的最终 Boss 之前无法获得 给帕奇的信，则可能会错过。",
    "104200": "在史东薇尔城中与涅斐丽交谈后，在圆桌厅堂中由涅斐丽给予。 如果需要击败史东薇尔城的 Boss 才能到达史东薇尔城，则可能会错过。",
    "104220": "由 涅斐丽 在她的任务结束时给予。如果在烧录黄金树之前无法获得风暴鹰古王，我会错过吗？",
    "114210": "如果你杀了她，就会从 涅斐丽 掉落。如果你完成了她的任务，可能会错过。",
    "110810": "如果你杀了她，就会从 海妲 掉落。如果你完成了她的任务，可能会错过。",
    "100890": "在任务结束时从 海妲 掉落。如果你在那之前杀了她，可能会错过。",
    "100760": "完成第一个 火山官邸 请求后由 塔妮丝 给出。如果在击败火山官邸的最终boss之前无法获得客房钥匙或来自火山官邸的信 (伊修托邦)，则可以错过。",
    "100770": "完成第二个 火山官邸 请求后由 塔妮丝 给出。如果在击败火山官邸的最终boss之前无法完成第一个请求或无法获得来自火山官邸的信 (莱利)，则可能会错过。",
    "100780": "由 塔妮丝 在完成第三个 火山官邸 请求后给出。如果在击败火山官邸的最终boss之前无法完成第二个请求或无法获得鲜红书信，则可能会错过。",
    "100730": "在火山官邸客房的一张桌子上。如果在击败火山官邸的最终boss之前无法获得客房钥匙，则可以错过。",
    "100740": "在火山官邸客房的一张桌子上。如果在击败 火山官邸 的最终 Boss 之前无法完成第一个 火山官邸 请求，则可能会错过。",
    "100750": "在火山官邸客房的一张桌子上。如果在击败 火山官邸 的最终 Boss 之前无法完成第二个 火山官邸 请求，则可能会错过。",
    "100900": "将菈雅的项链归还给她后，由菈雅给予。如果必须加入火山官邸才能获得项链，则可能会错过。",
    "100910": "在任务结束时从 菈雅 掉落。如果您在击败 火山官邸 的最终 Boss 之前无法获得 蛇的羊膜，则可能会错过。",
    "100500": "当葛托克跟随你时与他对峙后给出。 如果需要击败史东薇尔城的 Boss 才能到达史东薇尔城，则可能会错过。",
    "100018": "完成涅斐丽的任务后可在葛托克商店购买。如果您无法完成涅斐丽的任务，可能会错过。",
    "103910": "给她猎杀指头刀后，由菈妮给她。如果 猎杀指头刀 在 蕾娜魔法师塔 内部或被 灾厄影子、布莱泽、赛尔维斯 或 伊吉 掉落，则可能会错过。",
    "1034510900": "在蕾娜魔法师塔内部的箱子里。如果 猎杀指头刀 在 蕾娜魔法师塔 内部或被 灾厄影子、布莱泽、赛尔维斯 或 伊吉 掉落，则可能会错过。",
    "101430": "由 赛尔维斯 在 希芙拉河 中与 布莱泽 交谈后给出。如果 拉塔恩 音乐节在您加入 菈妮 之前开始，您可能会错过。",
    "101410": "赛尔维斯 给他 琥珀星光 后又给了他。如果在将 菈妮 提供给 猎杀指头刀 之前无法获得，则可以错过。",
    "101450": "赛尔维斯 给他 琥珀星光 后又给了他。如果在将 菈妮 提供给 猎杀指头刀 之前无法获得，则可以错过。",
    "100301": "将 赛尔维斯的药水 交给 涅斐丽 后，可在 赛尔维斯 木偶店购买。如果你不给她药水，可能会错过。",
    "100310": "将 赛尔维斯的药水 交给 食粪者 后，可在 赛尔维斯 木偶店购买。如果你不给他药水，可能会错过。",
    "100177": "给 米莉森 纯净金针 (修复) 后，可在 格威 商店购买。如果由 格威、米莉森 或其姐妹持有，则可能会错过。",
    "100175": "给 米莉森 纯净金针 (修复) 后，可在 格威 商店购买。如果由 格威、米莉森 或她的姐妹持有，则可能会错过。",
    "100176": "给 米莉森 纯净金针 (修复) 后，可在 格威 商店购买。如果由 格威、米莉森 或其姐妹持有，则可能会错过。",
    "100185": "给 米莉森 女武神的义手 后，可在 格威 商店购买。如果由 格威、米莉森 或其姐妹持有，则可能会错过。",
    "103100": "在给他 纯净金针 (破碎) 后，由 格威 给予。如果由 格威、米莉森 或她的姐妹持有，则可能会错过。",
    "103110": "在给他 纯净金针 (破碎) 后，由 格威 给予。如果由 格威、米莉森 或她的姐妹持有，则可能会错过。",
    "103120": "在任务结束时杀死 格威 后从他身上掉落。如果他的任务无法完成，可能会错过。",
    "103200": "将 纯净金针 (修复) 交给她后，由 米莉森 给予。如果由 格威、米莉森 或其姐妹持有，则可能会错过。",
    "103210": "帮助她击败她的姐妹后从 米莉森 掉落。如果你站在她的姐妹一边，可能会错过。",
    "103220": "给她 女武神的义手 后杀死她，然后从 米莉森 掉落。如果你完成了她的任务，可能会错过。",
    "113200": "通过协助她的姐妹击败米莉森的奖励。如果您支持 米莉森，可能会错过。",
    "104800": "击败米莉森姐妹的奖励。如果你站在她的姐妹一边，可能会错过。",
    "104600": "由 小壶 在他的任务结束时给予。如果无法完成 狄亚罗斯 任务，可能会错过。",
    "100420": "这在spoiler文件中显示为属于“流浪商人”咖列，但实际上并没有出现在他的商店中，无法获得。",
    "34140720": "从罗德尔和禁域之间的桥上的敌人掉落。 有时，这不会被授予。",
    "402030001": "在尊贵者的英雄墓地中，从重门附近和上方的敌人处掉落。 有时，这不会被授予。",
    "1037500000": "这在spoiler文件中显示为接近谷底秘村，但实际上并没有出现在世界中，也无法获得。",
    "39200000": "它在 spoiler 文件中显示为与 古遗迹断崖（对岸） 旁边的电梯底部附近的另一个项目位于同一位置，但它实际上并未出现在世界中，也无法获得。",
}
