# Copyright (c) 2023 The Old Man and the C
#
# This file is part of Elden Ring Randomizer Hints.
#
# Elden Ring Randomizer Hints is free software: you can redistribute it and/or
# modify it under the terms of the GNU Affero General Public License as
# published by the Free Software Foundation, either version 3 of the License, or
# (at your option) any later version.
#
# Elden Ring Randomizer Hints is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
# or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Affero General Public License
# for more details.
#
# You should have received a copy of the GNU Affero General Public License along
# with Elden Ring Randomizer Hints. If not, see <https://www.gnu.org/licenses/>.

missableLots_thath = {
    "104100": "มอบให้โดย รา​ติ​น่า หลังจากพบเธอด้วย เหรียญ​ศิลา​ลับ​พฤกษา​ศักดิสิทธิ ครึ่งหนึ่งทางขวา พลาดได้ถ้าได้ครึ่งซ้ายก่อน",
    "104110": "มอบให้โดย รา​ติ​น่า หลังจากพาเธอไปที่ บ้าน​ร้าง​ผู้​ละทิง พลาดได้ถ้าเธอตายก่อนที่คุณจะพบเธอใน กระท่อม​หมาปา​นิทรา",
    "101500": "มอบให้โดย ไบ​ลด หลังจากเอาชนะบอสใน คุก​ปด​ผนึก​แห่ง​สุนัข​ล่า​เนือ​ไร้​นาย พลาดไม่ได้หากเทศกาล รา​ดาห์น เริ่มต้นก่อนที่คุณจะพบเขาใน ปา​แห่ง​หมอก",
    "101590": "มอบให้โดย แร​น​นี หลังจากเอาชนะ เงา​หายนะ ใน แม่นํา​เอน​เซล​สาย​หลัก บางครั้งสิ่งนี้จะไม่ได้รับรางวัล",
    "1035460700": "รางวัลสำหรับการเอาชนะ แม่นํา​เอน​เซล​สาย​หลัก พลาดได้หาก ยู​ร่า ตายก่อนที่คุณจะสามารถช่วยเขาได้",
    "101610": "มอบให้โดย ยู​ร่า หลังจากช่วยเหลือเขาในการต่อสู้กับ แม่นํา​เอน​เซล​สาย​หลัก พลาดได้หาก ยู​ร่า ตายก่อนที่คุณจะสามารถช่วยเขาได้",
    "449020001": "ดรอปจากหนึ่งในหม้อมีชีวิตขนาดใหญ่ใน หมู่บ้าน​ไห พลาดได้หากคุณไม่ต้องการที่จะฆ่า NPC อย่างสงบ",
    "449020011": "ดรอปจากหนึ่งในหม้อมีชีวิตขนาดใหญ่ใน หมู่บ้าน​ไห พลาดได้หากคุณไม่ต้องการที่จะฆ่า NPC อย่างสงบ",
    "104000": "มอบให้โดย เจ​อร์เรน หลังจากช่วยเขาเอาชนะ เซล​เลน พลาดไม่ได้ถ้าเข้าข้าง เซล​เลน.",
    "104010": "รางวัลสำหรับการเอาชนะ เจ​อร์เรน พลาดได้ถ้าอยู่เคียงข้างเขา",
    "101010": "มอบให้โดย เซล​เลน หลังจากช่วยเหลือเธอในการต่อสู้กับ เจ​อร์เรน พลาดไม่ได้ถ้าเข้าข้าง เจ​อร์เรน.",
    "100056": "มีจำหน่ายในร้าน เซล​เลน หลังจากช่วยเหลือเธอในการต่อสู้กับ เจ​อร์เรน พลาดไม่ได้ถ้าเข้าข้าง เจ​อร์เรน.",
    "101030": "มอบให้โดย เซล​เลน สำหรับการค้นหา ลูซัทม อาจพลาดได้หาก กุญแจ​ผนึก​เซล​เลีย ถือโดย ลูซัทม หรือไม่สามารถหาได้",
    "101070": "ปรากฏตัวใกล้กับ เซล​เลน หลังจากที่เธอแปลงร่างเมื่อสิ้นสุดภารกิจ พลาดได้หากคุณเข้าข้าง เจ​อร์เรน หรือไม่สามารถรับรางวัลจากการค้นหา ลูซัทม ได้",
    "100361": "มีจำหน่ายในร้าน คอ​ริน หลังจากเปิดโปงรูปปั้น รา​ดา​กอน แล้ว อาจพลาดได้หากไม่สามารถหา ทฤษฎี​หวน​คืน ได้ก่อนที่จะเบิร์น พฤกษา​ทอง",
    "4900": "ดรอปจาก หน้ากาก​ทอง เมื่อสิ้นสุดภารกิจของเขา อาจพลาดได้หากไม่สามารถหา ทฤษฎี​หวน​คืน ได้ก่อนที่จะเบิร์น พฤกษา​ทอง",
    "105000": "ดรอปจาก หน้ากาก​ทอง เมื่อสิ้นสุดภารกิจของเขา อาจพลาดได้หากไม่สามารถหา ทฤษฎี​หวน​คืน ได้ก่อนที่จะเบิร์น พฤกษา​ทอง",
    "103582": "ดรอปจาก โร​เจียร์ เมื่อสิ้นสุดภารกิจของเขา บางครั้งสิ่งนี้จะไม่ปรากฏขึ้น",
    "103320": "มอบให้โดย เฟย สำหรับมอบ โร​เจียร์ เป็น ตรา​ประทับ​ดาบ​ทมิฬ พลาดได้หากต้องเข้าร่วม แร​น​นี เพื่อรับ",
    "103350": "ดรอปจาก เฟย หลังจากเอาชนะบอสใน Deathbed Dream พลาดได้ถ้า ตรา​คํา​สาป​มรณะ ถือโดยเจ้านายคนนั้นหรือ D ​ผู้​มอง​เห็น​มรณะ",
    "103410": "ดรอปจาก D ​ผู้​มอง​เห็น​มรณะ เมื่อสิ้นสุดภารกิจของเขา พลาดไม่ได้ถ้า ตรา​คํา​สาป​มรณะ ถือโดยบอสแห่ง Deathbed Dream หรือ D ​ผู้​มอง​เห็น​มรณะ",
    "1039480100": "อยู่ในอกด้านบนของ หอคอย​แปร​ศรัทธา​แดน​ไกล. พลาดได้ถ้า กุญแจ​หิน​จรัส​วิทยาลัย (โธปส์) อยู่ในหีบเดียวกันหรือหาไม่ได้อย่างอื่น",
    "11001985": "รางวัลสำหรับการเอาชนะ วาร์​แก​รม ​หมาปา​อสูร​สงคราม และ วิล​เฮล์ม ​จอม​เวท​พลัด​หลง พลาดได้หากไม่สามารถรับ จดหมาย​ถึง​เบอร์​นาห์ล ได้ก่อนที่จะเอาชนะบอสตัวสุดท้ายของ คฤหาสน์​ภูผา​เพลิง",
    "111700": "ดรอปจาก อ​เล็ก​ซาน​เด​อร์ หากคุณฆ่าเขาก่อนที่จะจบภารกิจ สามารถพลาดได้หากคุณทำภารกิจของเขาสำเร็จ",
    "101740": "ดรอปจาก อ​เล็ก​ซาน​เด​อร์ หลังจากเสร็จสิ้นภารกิจของเขา อาจพลาดได้หากคุณฆ่าเขาก่อนหน้านั้น",
    "101710": "มอบให้โดย อ​เล็ก​ซาน​เด​อร์ หลังจากปลดปล่อยเขาจากหลุมใน ลิ​เอ​อร์​เนีย พลาดได้หากคุณไม่สามารถสร้าง ไห​นํามัน ได้ก่อนที่เขาจะปรากฏตัวใน ภูเขา​ไฟ​เกล​เมีย",
    "112200": "ดรอปจาก เคน​เนธ ถ้าคุณฆ่าเขา สามารถพลาดได้หากคุณทำภารกิจของเขาสำเร็จ",
    "104512": "ดรอปจาก เดีย​รอส เมื่อสิ้นสุดภารกิจของเขา พลาดได้หากคุณไม่สามารถทำตามคำขอ คฤหาสน์​ภูผา​เพลิง ได้ก่อนที่จะเอาชนะบอสตัวสุดท้ายของ คฤหาสน์​ภูผา​เพลิง",
    "101800": "มอบให้โดย แพ​ทช์ หลังจากเสร็จสิ้นการร้องขอ คฤหาสน์​ภูผา​เพลิง แรก พลาดได้หากคุณไม่สามารถทำตามคำขอได้ก่อนที่จะเอาชนะบอสตัวสุดท้ายของ คฤหาสน์​ภูผา​เพลิง",
    "101820": "มอบให้โดย แพ​ทช์ หลังจากเสร็จสิ้นคำขอการบุกรุกของเขา พลาดได้หากไม่สามารถหา จดหมาย​ถึง​แพ​ทช์ ได้ก่อนที่จะเอาชนะบอสตัวสุดท้ายของ คฤหาสน์​ภูผา​เพลิง",
    "104200": "มอบให้โดย เน​เฟลี ใน โต๊ะ​กลม หลังจากพูดคุยกับเธอใน ปราสาท​ส​ตอร์ม​วีล พลาดได้หากจำเป็นต้องเอาชนะบอสของ ปราสาท​ส​ตอร์ม​วีล เพื่อไปถึง ปราสาท​ส​ตอร์ม​วีล",
    "104220": "มอบให้โดย เน​เฟลี เมื่อสิ้นสุดภารกิจของเธอ ฉันจะพลาดได้ไหมถ้าไม่สามารถรับ อดีต​ราชา​เหยียว​วายุ ก่อนที่จะเบิร์น พฤกษา​ทอง",
    "114210": "ดรอปจาก เน​เฟลี ถ้าคุณฆ่าเธอ สามารถพลาดได้หากคุณทำภารกิจของเธอสำเร็จ",
    "110810": "ดรอปจาก ไฮ​ยี​ต้า ถ้าคุณฆ่าเธอ สามารถพลาดได้หากคุณทำภารกิจของเธอสำเร็จ",
    "100890": "ดรอปจาก ไฮ​ยี​ต้า เมื่อสิ้นสุดภารกิจของเธอ อาจพลาดได้หากคุณฆ่าเธอก่อนหน้านั้น",
    "100760": "มอบให้โดย ทา​นิธ หลังจากเสร็จสิ้นการร้องขอ คฤหาสน์​ภูผา​เพลิง แรก พลาดได้หากไม่สามารถรับ กุญแจ​ห้อง​รับรอง หรือ จดหมาย​จาก​คฤหาสน์​ภูผา​เพลิง (อิชท์​วาน) ได้ก่อนที่จะเอาชนะบอสตัวสุดท้ายของ คฤหาสน์​ภูผา​เพลิง",
    "100770": "มอบให้โดย ทา​นิธ หลังจากเสร็จสิ้นการร้องขอ คฤหาสน์​ภูผา​เพลิง ที่สอง พลาดได้หากไม่สามารถดำเนินการตามคำขอแรกได้หรือไม่สามารถรับ จดหมาย​จาก​คฤหาสน์​ภูผา​เพลิง (ไรลี) ได้ก่อนที่จะเอาชนะบอสตัวสุดท้ายของ คฤหาสน์​ภูผา​เพลิง",
    "100780": "มอบให้โดย ทา​นิธ หลังจากเสร็จสิ้นการร้องขอ คฤหาสน์​ภูผา​เพลิง ครั้งที่สาม อาจพลาดได้หากไม่สามารถดำเนินการตามคำขอที่สองได้หรือไม่สามารถรับ จดหมาย​สี​แดง ได้ก่อนที่จะเอาชนะบอสตัวสุดท้ายของ คฤหาสน์​ภูผา​เพลิง",
    "100730": "บนโต๊ะใน คฤหาสน์​ภูผา​เพลิง ห้อง​รับรอง พลาดได้หากไม่สามารถรับ กุญแจ​ห้อง​รับรอง ได้ก่อนที่จะเอาชนะบอสตัวสุดท้ายของ คฤหาสน์​ภูผา​เพลิง",
    "100740": "บนโต๊ะใน คฤหาสน์​ภูผา​เพลิง ห้อง​รับรอง พลาดได้หากไม่สามารถดำเนินการตามคำขอ คฤหาสน์​ภูผา​เพลิง แรกได้ก่อนที่จะเอาชนะบอสตัวสุดท้ายของ คฤหาสน์​ภูผา​เพลิง",
    "100750": "บนโต๊ะใน คฤหาสน์​ภูผา​เพลิง ห้อง​รับรอง พลาดได้หากไม่สามารถดำเนินการตามคำขอ คฤหาสน์​ภูผา​เพลิง ครั้งที่สองได้ก่อนที่จะเอาชนะบอสตัวสุดท้ายของ คฤหาสน์​ภูผา​เพลิง",
    "100900": "มอบให้โดย รายา หลังจากคืน เครือง​ประดับ​คอ​ของ​รา​ยา ให้เธอแล้ว พลาดได้หากคุณต้องเข้าร่วม คฤหาสน์​ภูผา​เพลิง เพื่อรับสร้อยคอ",
    "100910": "ดรอปจาก รายา เมื่อสิ้นสุดภารกิจของเธอ พลาดได้หากคุณไม่สามารถรับ ถุง​นํา​ครํา​อสรพิษ ได้ก่อนที่จะเอาชนะบอสตัวสุดท้ายของ คฤหาสน์​ภูผา​เพลิง",
    "100500": "มอบให้โดย กอ​สต็​อก หลังจากเผชิญหน้ากับเขาเมื่อเขาติดตามคุณ พลาดได้หากจำเป็นต้องเอาชนะบอสของ ปราสาท​ส​ตอร์ม​วีล เพื่อไปถึง ปราสาท​ส​ตอร์ม​วีล",
    "100018": "มีจำหน่ายในร้านค้า กอ​สต็​อก หลังจากสำเร็จภารกิจของ เน​เฟลี สามารถพลาดได้หากคุณไม่สามารถทำภารกิจของ เน​เฟลี ให้สำเร็จได้",
    "103910": "มอบให้โดย แร​น​นี หลังจากมอบ คม​ดาบ​พิฆาต​องคุลี ให้เธอ สามารถพลาดได้หาก คม​ดาบ​พิฆาต​องคุลี อยู่ภายใน หอคอย​จอม​เวท​เร็น​น่า หรือหลุดโดย เงา​หายนะ, ไบ​ลด, เซลู​วิส หรือ อิจิ",
    "1034510900": "อยู่ในหีบภายใน หอคอย​จอม​เวท​เร็น​น่า สามารถพลาดได้หาก คม​ดาบ​พิฆาต​องคุลี อยู่ภายใน หอคอย​จอม​เวท​เร็น​น่า หรือหลุดโดย เงา​หายนะ, ไบ​ลด, เซลู​วิส หรือ อิจิ",
    "101430": "มอบให้โดย เซลู​วิส หลังจากพูดคุยกับ ไบ​ลด ใน แม่นํา​ซี​โอ​ฟ​รา พลาดไม่ได้หากเทศกาล รา​ดาห์น เริ่มต้นก่อนที่คุณจะเข้าร่วม แร​น​นี",
    "101410": "มอบให้โดย เซลู​วิส หลังจากที่มอบ แสง​ดารา​อําพัน ให้เขาแล้ว พลาดได้ถ้าหาไม่ได้ก่อนให้ แร​น​นี กับ คม​ดาบ​พิฆาต​องคุลี",
    "101450": "มอบให้โดย เซลู​วิส หลังจากที่มอบ แสง​ดารา​อําพัน ให้เขาแล้ว พลาดได้ถ้าหาไม่ได้ก่อนให้ แร​น​นี กับ คม​ดาบ​พิฆาต​องคุลี",
    "100301": "มีจำหน่ายในร้านหุ่น เซลู​วิส หลังจากมอบ โอสถ​ของ​เซลู​วิส ให้กับ เน​เฟลี แล้ว พลาดได้ถ้าคุณไม่ให้ยาให้เธอ",
    "100310": "มีจำหน่ายในร้านหุ่น เซลู​วิส หลังจากมอบ โอสถ​ของ​เซลู​วิส ให้กับ ผู้​เสพ​อาจม แล้ว อาจพลาดได้ถ้าคุณไม่ให้ยาแก่เขา",
    "100177": "มีจำหน่ายในร้าน โกว์​รี หลังจากมอบ มิลลิ​เซนต์ เป็น เข็ม​ทอง​บริสุทธิ (ซ่อม แซม) แล้ว พลาดไม่ได้ถ้าถือโดย โกว์​รี, มิลลิ​เซนต์ หรือน้องสาวของเธอ",
    "100175": "มีจำหน่ายในร้าน โกว์​รี หลังจากมอบ มิลลิ​เซนต์ เป็น เข็ม​ทอง​บริสุทธิ (ซ่อม แซม) แล้ว พลาดไม่ได้ถ้าถือโดย โกว์​รี, มิลลิ​เซนต์ หรือน้องสาวของเธอ",
    "100176": "มีจำหน่ายในร้าน โกว์​รี หลังจากมอบ มิลลิ​เซนต์ เป็น เข็ม​ทอง​บริสุทธิ (ซ่อม แซม) แล้ว พลาดไม่ได้ถ้าถือโดย โกว์​รี, มิลลิ​เซนต์ หรือน้องสาวของเธอ",
    "100185": "มีจำหน่ายในร้าน โกว์​รี หลังจากมอบ มิลลิ​เซนต์ เป็น มือ​เทียม​ของ​นารี​สงคราม แล้ว พลาดไม่ได้ถ้าถือโดย โกว์​รี, มิลลิ​เซนต์ หรือน้องสาวของเธอ",
    "103100": "มอบให้โดย โกว์​รี หลังจากที่มอบ เข็ม​ทอง​บริสุทธิ (หัก) ให้เขาแล้ว พลาดไม่ได้ถ้าถือโดย โกว์​รี, มิลลิ​เซนต์ หรือน้องสาวของเธอ",
    "103110": "มอบให้โดย โกว์​รี หลังจากที่มอบ เข็ม​ทอง​บริสุทธิ (หัก) ให้เขาแล้ว พลาดไม่ได้ถ้าถือโดย โกว์​รี, มิลลิ​เซนต์ หรือน้องสาวของเธอ",
    "103120": "ดรอปจาก โกว์​รี หลังจากฆ่าเขาเมื่อสิ้นสุดภารกิจ สามารถพลาดได้หากไม่สามารถทำภารกิจให้สำเร็จได้",
    "103200": "มอบให้โดย มิลลิ​เซนต์ หลังจากมอบ เข็ม​ทอง​บริสุทธิ (ซ่อม แซม) ให้เธอ พลาดไม่ได้ถ้าถือโดย โกว์​รี, มิลลิ​เซนต์ หรือน้องสาวของเธอ",
    "103210": "ดรอปจาก มิลลิ​เซนต์ หลังจากช่วยเธอเอาชนะพี่สาวของเธอ พลาดได้ถ้าอยู่เคียงข้างพี่สาว",
    "103220": "ดรอปจาก มิลลิ​เซนต์ หลังจากฆ่าเธอหลังจากมอบ มือ​เทียม​ของ​นารี​สงคราม ให้เธอ สามารถพลาดได้หากคุณทำภารกิจของเธอสำเร็จ",
    "113200": "รางวัลจากการเอาชนะ มิลลิ​เซนต์ โดยการช่วยเหลือน้องสาวของเธอ พลาดไม่ได้ถ้าเข้าข้าง มิลลิ​เซนต์.",
    "104800": "รางวัลจากการเอาชนะพี่สาวของ มิลลิ​เซนต์ พลาดได้ถ้าอยู่เคียงข้างพี่สาว",
    "104600": "มอบให้โดย ไห​น้อย เมื่อสิ้นสุดภารกิจของเขา พลาดได้หากไม่สามารถทำภารกิจ เดีย​รอส ให้สำเร็จได้",
    "100420": "สิ่งนี้ปรากฏในไฟล์ spoiler ว่าเป็นของ คา​เล่ ​พ่อค้า​เร่ร่อน แต่จริงๆ แล้วมันไม่ปรากฏในร้านค้าของเขาและไม่สามารถรับได้",
    "34140720": "ดรอปจากศัตรูบนสะพานระหว่างเลน​เดลและแดน​ต้อง​ห้ามบางครั้งสิ่งนี้จะไม่ได้รับรางวัล",
    "402030001": "ดรอปจากศัตรูใกล้และเหนือประตูหนักในสุสาน​วีรชน​ของ​ชนชัน​สูงบางครั้งสิ่งนี้จะไม่ได้รับรางวัล",
    "1037500000": "สิ่งนี้ปรากฏในไฟล์ spoiler ว่าอยู่ใกล้ หมู่บ้าน​เร้น​ลับ​ใต้​หุบเหว แต่จริงๆ แล้วไม่ปรากฏในโลกและไม่สามารถรับได้",
    "39200000": "สิ่งนี้ปรากฏในไฟล์ spoiler ว่าอยู่ในตำแหน่งเดียวกันกับรายการอื่นใกล้ฐานลิฟต์ถัดจาก ง​ตรง​ข้าม ​เชิง​ผา​ซาก​โบราณ​สถาน แต่จริงๆ แล้วมันไม่ปรากฏบนโลกและไม่สามารถรับได้",
}
