# Copyright (c) 2023 The Old Man and the C
#
# This file is part of Elden Ring Randomizer Hints.
#
# Elden Ring Randomizer Hints is free software: you can redistribute it and/or
# modify it under the terms of the GNU Affero General Public License as
# published by the Free Software Foundation, either version 3 of the License, or
# (at your option) any later version.
#
# Elden Ring Randomizer Hints is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
# or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Affero General Public License
# for more details.
#
# You should have received a copy of the GNU Affero General Public License along
# with Elden Ring Randomizer Hints. If not, see <https://www.gnu.org/licenses/>.

missableLots_zhotw = {
    "104100": "勒緹娜 在與 聖樹祕密符節 的右半部會面後給予她。如果您先獲得左半部分，則可能會錯過。",
    "104110": "由勒緹娜將她帶到離教廢屋後給予。如果你在 眠狼的破屋 中見到她之前她就去世了，你可能會錯過她。",
    "101500": "無主獵犬的封印監牢擊敗Boss後布萊澤贈送。如果 拉塔恩 音樂節在您在 霧林 見到他之前開始，您可能會錯過。",
    "101590": "在安瑟爾河主流中擊敗災厄影子後由菈妮給予。有時這不會被授予。",
    "1035460700": "擊敗安瑟爾河主流的獎勵。如果 尤拉 在您幫助他之前死亡，則可能會錯過。",
    "101610": "由尤拉在協助他對抗安瑟爾河主流後給予。如果 尤拉 在您幫助他之前死亡，則可能會錯過。",
    "449020001": "從 壺村 的大型生活罐之一掉落。如果你不想殺死和平的NPC，可以錯過。",
    "449020011": "從 壺村 的大型生活罐之一掉落。如果你不想殺死和平的NPC，可以錯過。",
    "104000": "傑廉幫他打敗瑟濂後贈送。如果您支持 瑟濂，可能會錯過。",
    "104010": "擊敗傑廉的獎勵。如果你站在他這邊，你可能會錯過。",
    "101010": "瑟濂在協助她對抗傑廉後給予。如果您支持 傑廉，可能會錯過。",
    "100056": "協助她對抗 傑廉 後，可在 瑟濂 商店中找到。如果您支持 傑廉，可能會錯過。",
    "101030": "由 瑟濂 給出，用於尋找 盧瑟特。如果 瑟利亞封印鑰匙 由 盧瑟特 持有或以其他方式無法取得，則可能會錯過。",
    "101070": "瑟濂 在任務結束時變形後出現在她附近。如果您支持 傑廉 或無法獲得她尋找 盧瑟特 的獎勵，則可能會錯過。",
    "100361": "揭開 拉達岡 雕像後，可在 柯林 商店購買。如果在刻錄 黃金樹 之前無法取得 回歸性原理，則可能會錯過。",
    "4900": "任務結束時從 金面具 掉落。如果在刻錄 黃金樹 之前無法取得 回歸性原理，則可能會錯過。",
    "105000": "任務結束時從 金面具 掉落。如果在刻錄 黃金樹 之前無法取得 回歸性原理，則可能會錯過。",
    "103582": "任務結束時從 羅傑爾 掉落。有時這個不會出現。",
    "103320": "由 菲雅 給予 羅傑爾 黑刀烙印。如果需要加入菈妮才能獲得，可以錯過。",
    "103350": "擊敗臨終之夢中的 Boss 後，從 菲雅 掉落。如果 死亡的咒痕 被該 Boss 或 「覲見死亡」Ｄ 持有，則可能會錯過。",
    "103410": "任務結束時從 「覲見死亡」Ｄ 掉落。如果 死亡的咒痕 被臨終之夢或 「覲見死亡」Ｄ 的 Boss 持有，則可能會錯過。",
    "1039480100": "改宗邊境塔頂部的箱子裡。如果 學院輝石鑰匙 (托普斯) 位於同一個箱子中或無法獲得，則可能會錯過。",
    "11001985": "擊敗「白狼戰鬼」巴格萊姆和「離群魔法師」維赫勒的獎勵。如果在擊敗 火山官邸 的最終 Boss 之前無法獲得 給貝納爾的信，則可能會錯過。",
    "111700": "如果你在完成他的任務之前殺死他，就會從 亞歷山大 中掉落。如果你完成了他的任務，可能會錯過。",
    "101740": "完成任務後從 亞歷山大 掉落。如果你在那之前殺了他，可能會錯過。",
    "101710": "亞歷山大 將他從 利耶尼亞 的洞中釋放後給予。如果您在 油壺 出現在 格密爾火山 之前無法製作 油壺，則可能會錯過。",
    "112200": "如果你殺了他，就會從 肯尼斯 中掉落。如果你完成了他的任務，可能會錯過。",
    "104512": "任務結束時從 狄亞羅斯 掉落。如果您在擊敗 火山官邸 的最終 Boss 之前無法完成 火山官邸 的請求，則可能會錯過。",
    "101800": "完成第一個 火山官邸 請求後由 帕奇 給出。如果您在擊敗 火山官邸 的最終 Boss 之前無法完成請求，則可能會錯過。",
    "101820": "帕奇完成入侵請求後給予。如果在擊敗 火山官邸 的最終 Boss 之前無法獲得 給帕奇的信，則可能會錯過。",
    "104200": "在史東薇爾城中與涅斐麗交談後，在圓桌廳堂中由涅斐麗給予。 如果需要擊敗史東薇爾城的 Boss 才能到達史東薇爾城，則可能會錯過。",
    "104220": "由 涅斐麗 在她的任務結束時給予。如果在燒錄黃金樹之前無法獲得風暴鷹古王，我會錯過嗎？",
    "114210": "如果你殺了她，就會從 涅斐麗 掉落。如果你完成了她的任務，可能會錯過。",
    "110810": "如果你殺了她，就會從 海妲 掉落。如果你完成了她的任務，可能會錯過。",
    "100890": "任務結束時從 海妲 掉落。如果你在那之前殺了她，可能會錯過。",
    "100760": "完成第一個 火山官邸 請求後由 塔妮絲 給出。如果在擊敗火山官邸的最終頭目之前無法獲得客房鑰匙或來自火山官邸的信 (伊修托邦)，則可以錯過。",
    "100770": "完成第二個 火山官邸 請求後由 塔妮絲 給出。如果在擊敗火山官邸的最終頭目之前無法完成第一個請求或無法獲得來自火山官邸的信 (萊利)，則可能會錯過。",
    "100780": "完成第三個 火山官邸 請求後由 塔妮絲 給出。如果在擊敗火山官邸的最終頭目之前無法完成第二個請求或無法獲得鮮紅書信，則可能會錯過。",
    "100730": "在火山官邸客房的一張桌子上。如果在擊敗火山官邸的最終頭目之前無法獲得客房鑰匙，則可以錯過。",
    "100740": "在火山官邸客房的一張桌子上。如果在擊敗 火山官邸 的最終 Boss 之前無法完成第一個 火山官邸 請求，則可能會錯過。",
    "100750": "在火山官邸客房的一張桌子上。如果在擊敗 火山官邸 的最終 Boss 之前無法完成第二個 火山官邸 請求，則可能會錯過。",
    "100900": "將菈雅的項鍊歸還給她後，由菈雅給予。如果必須加入火山官邸才能獲得項鍊，則可能會錯過。",
    "100910": "任務結束時從 菈雅 掉落。如果您在擊敗 火山官邸 的最終 Boss 之前無法獲得 蛇的羊膜，則可能會錯過。",
    "100500": "當葛托克跟隨你時與他對峙後給予。 如果需要擊敗史東薇爾城的 Boss 才能到達史東薇爾城，則可能會錯過。",
    "100018": "完成涅斐麗的任務後可在葛托克商店購買。如果您無法完成涅斐麗的任務，可能會錯過。",
    "103910": "給她獵殺指頭刀後，由菈妮送給她。如果 獵殺指頭刀 在 蕾娜魔法師塔 內部或被 災厄影子、布萊澤、賽爾維斯 或 伊吉 掉落，則可能會錯過。",
    "1034510900": "在蕾娜魔法師塔內部的箱子裡。如果 獵殺指頭刀 在 蕾娜魔法師塔 內部或被 災厄影子、布萊澤、賽爾維斯 或 伊吉 掉落，則可能會錯過。",
    "101430": "由 賽爾維斯 在 希芙拉河 中與 布萊澤 交談後給出。如果 拉塔恩 音樂節在您加入 菈妮 之前開始，您可能會錯過。",
    "101410": "賽爾維斯 給他 琥珀星光 後又給了他。如果在將 菈妮 提供給 獵殺指頭刀 之前無法取得，則可以錯過。",
    "101450": "賽爾維斯 給他 琥珀星光 後又給了他。如果在將 菈妮 提供給 獵殺指頭刀 之前無法取得，則可以錯過。",
    "100301": "將 賽爾維斯的藥水 交給 涅斐麗 後，可在 賽爾維斯 木偶店購買。如果你不給她藥水，可能會錯過。",
    "100310": "將 賽爾維斯的藥水 交給 食糞者 後，可在 賽爾維斯 木偶店購買。如果你不給他藥水，可能會錯過。",
    "100177": "給 米莉森 純淨金針 (修復) 後，可在 格威 商店購買。如果由 格威、米莉森 或其姊妹持有，則可能會錯過。",
    "100175": "給 米莉森 純淨金針 (修復) 後，可在 格威 商店購買。如果由 格威、米莉森 或其姊妹持有，則可能會錯過。",
    "100176": "給 米莉森 純淨金針 (修復) 後，可在 格威 商店購買。如果由 格威、米莉森 或她的姐妹持有，則可能會錯過。",
    "100185": "給 米莉森 女武神的義手 後，可在 格威 商店購買。如果由 格威、米莉森 或她的姐妹持有，則可能會錯過。",
    "103100": "在給他 純淨金針 (破碎) 後，由 格威 給予。如果由 格威、米莉森 或她的姐妹持有，則可能會錯過。",
    "103110": "在給他 純淨金針 (破碎) 後，由 格威 給予。如果由 格威、米莉森 或她的姐妹持有，則可能會錯過。",
    "103120": "在任務結束時殺死 格威 後從他身上掉落。如果他的任務無法完成，可能會錯過。",
    "103200": "將 純淨金針 (修復) 交給她後，由 米莉森 給予。如果由 格威、米莉森 或她的姐妹持有，則可能會錯過。",
    "103210": "幫助她擊敗她的姐妹後從 米莉森 掉落。如果你站在她的姊妹這邊，你可能會錯過。",
    "103220": "給她 女武神的義手 後殺死她，然後從 米莉森 掉落。如果你完成了她的任務，可能會錯過。",
    "113200": "透過協助她的姊妹擊敗米莉森的獎勵。如果您支援 米莉森，可能會錯過。",
    "104800": "擊敗米莉森姐妹的獎勵。如果你站在她的姊妹這邊，你可能會錯過。",
    "104600": "由 小壺 在他的任務結束時給予。如果無法完成 狄亞羅斯 任務，可能會錯過。",
    "100420": "這在spoiler文件中顯示為屬於「流浪商人」咖列，但實際上並沒有出現在他的商店中，無法取得。",
    "34140720": "從羅德爾和禁域之間的橋樑上的敵人掉落。 有時，這不會被授予。",
    "402030001": "在尊貴者的英雄墓地中，從重門附近和上方的敵人處掉落。 有時，這不會被授予。",
    "1037500000": "這在spoiler檔案中顯示為接近谷底祕村，但實際上並沒有出現在世界中，也無法取得。",
    "39200000": "它在 spoiler 文件中顯示為與 古遺跡斷崖（對岸） 旁邊的電梯底部附近的另一個項目位於同一位置，但它實際上並未出現在世界中，也無法獲得。",
}
